In [1]:
import pandas as pd
score_df = pd.DataFrame([[1,50,80,70,'boy',1], 
              [2,60,45,50,'boy',2],
              [3,98,43,55,'boy',1],
              [4,70,69,89,'boy',2],
              [5,56,79,60,'girl',1],
              [6,60,68,55,'girl',2],
              [7,45,70,77,'girl',1],
              [8,55,77,76,'girl',2],
              [9,25,57,60,'girl',1],
              [10,88,40,43,'girl',3],
              [11,25,60,45,'boy',3],
              [12,80,60,23,'boy',3],
              [13,20,90,66,'girl',3],
              [14,50,50,50,'girl',3],
              [15,89,67,77,'girl',3]],columns=['student_id','math_score','english_score','chinese_score','sex','class'])
score_df

    student_id  math_score  english_score  chinese_score   sex  class
0            1          50             80             70   boy      1
1            2          60             45             50   boy      2
2            3          98             43             55   boy      1
3            4          70             69             89   boy      2
4            5          56             79             60  girl      1
5            6          60             68             55  girl      2
6            7          45             70             77  girl      1
7            8          55             77             76  girl      2
8            9          25             57             60  girl      1
9           10          88             40             43  girl      3
10          11          25             60             45   boy      3
11          12          80             60             23   boy      3
12          13          20             90             66  girl      3
13          14          50             50             50  girl      3
14          15          89             67             77  girl      3

In [2]:
#1.找出全年級各科成績最高分與最低分?
print(score_df.math_score.apply(['max', 'min']))
print(score_df.english_score.apply(['max', 'min']))
print(score_df.chinese_score.apply(['max', 'min']))

max    98
min    20
Name: math_score, dtype: int64
max    90
min    40
Name: english_score, dtype: int64
max    89
min    23
Name: chinese_score, dtype: int64

In [3]:
score_df_melt = score_df.melt(value_vars=['math_score', 'english_score', 'chinese_score'])
score_df_melt.groupby('variable').agg(['max', 'min'])

              value
                max min
variable
chinese_score    89  23
english_score    90  40
math_score       98  20

In [4]:
#2.找出數學班平均最高的班級?
score_df.groupby('class').mean().math_score

class
1    54.800000
2    61.250000
3    58.666667
Name: math_score, dtype: float64

In [5]:
#3.分析全校女生與男生國文平均差幾分?
score_df.groupby('sex').mean().chinese_score

sex
boy     55.333333
girl    62.666667
Name: chinese_score, dtype: float64